NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_sysctrl.h
/* ========================================= Start of section using anonymous unions ========================================= */

#include "../../common/compiler_abstraction.h"

#if defined (__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined (__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
  #pragma clang diagnostic ignored "-Wgnu-anonymous-struct"
  #pragma clang diagnostic ignored "-Wnested-anon-types"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning 586
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Unsupported compiler type
#endif

/* =========================================================================================================================== */
/* ================                                  Peripheral Address Map                                  ================ */
/* =========================================================================================================================== */

#define NRF_SYSCTRL_HSFLL200_BASE         0xBF004000UL
#define NRF_SYSCTRL_MVDMA110_BASE         0x5F097000UL
#define NRF_SYSCTRL_PPIB110_BASE          0x5F098000UL
#define NRF_SYSCTRL_MEMCONF120_BASE       0x5F8C7000UL
#define NRF_SYSCTRL_PPIB120_BASE          0x5F8EE000UL
#define NRF_SYSCTRL_PPIB121_BASE          0x5F8EF000UL
#define NRF_SYSCTRL_MEMCONF130_BASE       0x5F905000UL
#define NRF_SYSCTRL_PPIB130_BASE          0x5F925000UL
#define NRF_SYSCTRL_PPIB131_BASE          0x5F926000UL
#define NRF_SYSCTRL_VDETPOF5V0_BASE       0x5F979000UL
#define NRF_SYSCTRL_PPIB132_BASE          0x5F98D000UL
#define NRF_SYSCTRL_PPIB133_BASE          0x5F99D000UL
#define NRF_SYSCTRL_PPIB134_BASE          0x5F9AD000UL
#define NRF_SYSCTRL_PPIB135_BASE          0x5F9BD000UL
#define NRF_SYSCTRL_PPIB136_BASE          0x5F9CD000UL
#define NRF_SYSCTRL_PPIB137_BASE          0x5F9DD000UL

/* =========================================================================================================================== */
/* ================                                  Peripheral Declaration                                  ================ */
/* =========================================================================================================================== */

#define NRF_SYSCTRL_HSFLL200              ((NRF_HSFLL_Type*)                    NRF_SYSCTRL_HSFLL200_BASE)
#define NRF_SYSCTRL_MVDMA110              ((NRF_MVDMA_Type*)                    NRF_SYSCTRL_MVDMA110_BASE)
#define NRF_SYSCTRL_PPIB110               ((NRF_PPIB_Type*)                     NRF_SYSCTRL_PPIB110_BASE)
#define NRF_SYSCTRL_MEMCONF120            ((NRF_MEMCONF_Type*)                  NRF_SYSCTRL_MEMCONF120_BASE)
#define NRF_SYSCTRL_PPIB120               ((NRF_PPIB_Type*)                     NRF_SYSCTRL_PPIB120_BASE)
#define NRF_SYSCTRL_PPIB121               ((NRF_PPIB_Type*)                     NRF_SYSCTRL_PPIB121_BASE)
#define NRF_SYSCTRL_MEMCONF130            ((NRF_MEMCONF_Type*)                  NRF_SYSCTRL_MEMCONF130_BASE)
#define NRF_SYSCTRL_PPIB130               ((NRF_PPIB_Type*)                     NRF_SYSCTRL_PPIB130_BASE)
#define NRF_SYSCTRL_PPIB131               ((NRF_PPIB_Type*)                     NRF_SYSCTRL_PPIB131_BASE)
#define NRF_SYSCTRL_VDETPOF5V0            ((NRF_VDETPOF5V0_Type*)               NRF_SYSCTRL_VDETPOF5V0_BASE)
#define NRF_SYSCTRL_PPIB132               ((NRF_PPIB_Type*)                     NRF_SYSCTRL_PPIB132_BASE)
#define NRF_SYSCTRL_PPIB133               ((NRF_PPIB_Type*)                     NRF_SYSCTRL_PPIB133_BASE)
#define NRF_SYSCTRL_PPIB134               ((NRF_PPIB_Type*)                     NRF_SYSCTRL_PPIB134_BASE)
#define NRF_SYSCTRL_PPIB135               ((NRF_PPIB_Type*)                     NRF_SYSCTRL_PPIB135_BASE)
#define NRF_SYSCTRL_PPIB136               ((NRF_PPIB_Type*)                     NRF_SYSCTRL_PPIB136_BASE)
#define NRF_SYSCTRL_PPIB137               ((NRF_PPIB_Type*)                     NRF_SYSCTRL_PPIB137_BASE)

/* =========================================================================================================================== */
/* ================                                  Local Domain Remapping                                  ================ */
/* =========================================================================================================================== */

#ifdef NRF_SYSCTRL                                   /*!< Remap NRF_DOMAIN_X instances to NRF_X symbol for ease of use.        */
  #define NRF_HSFLL200                            NRF_SYSCTRL_HSFLL200
  #define NRF_MVDMA110                            NRF_SYSCTRL_MVDMA110
  #define NRF_PPIB110                             NRF_SYSCTRL_PPIB110
  #define NRF_MEMCONF120                          NRF_SYSCTRL_MEMCONF120
  #define NRF_PPIB120                             NRF_SYSCTRL_PPIB120
  #define NRF_PPIB121                             NRF_SYSCTRL_PPIB121
  #define NRF_MEMCONF130                          NRF_SYSCTRL_MEMCONF130
  #define NRF_PPIB130                             NRF_SYSCTRL_PPIB130
  #define NRF_PPIB131                             NRF_SYSCTRL_PPIB131
  #define NRF_VDETPOF5V0                          NRF_SYSCTRL_VDETPOF5V0
  #define NRF_PPIB132                             NRF_SYSCTRL_PPIB132
  #define NRF_PPIB133                             NRF_SYSCTRL_PPIB133
  #define NRF_PPIB134                             NRF_SYSCTRL_PPIB134
  #define NRF_PPIB135                             NRF_SYSCTRL_PPIB135
  #define NRF_PPIB136                             NRF_SYSCTRL_PPIB136
  #define NRF_PPIB137                             NRF_SYSCTRL_PPIB137
#endif                                               /*!< NRF_SYSCTRL                                                          */

/* ========================================== End of section using anonymous unions ========================================== */

#if defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#endif


#ifdef __cplusplus
}
#endif
#endif /* NRF54H20_SYSCTRL_H */

